knaufinator/6DOF-Rotary-Stewart-Motion-Simulator/controller/sdkconfig.defaults.esp32
# ESP32 (PCBv1) Configuration Overrides
# Original ESP32 DevKit with MCP23S17 SPI GPIO expander for step/dir
#
# Build: idf.py set-target esp32 && idf.py build

# Target
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y

# Serial/Console — UART0 primary (ESP32 DevKit uses CP2102/CH340 USB-UART)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Flash size (4MB typical for ESP32 DevKit)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# ── IRAM Optimization (ESP32 has ~180KB IRAM, much less than S3) ──
# Move WiFi/BT RX buffers and code out of IRAM into flash
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_SLP_IRAM_OPT=n

# Place SPI flash driver functions in flash (not IRAM)
CONFIG_SPI_FLASH_ROM_DRIVER_PATCH=y

# Bluetooth — BLE only via Bluedroid (no Classic BT to save IRAM)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_NIMBLE_ENABLED=n
CONFIG_BT_CONTROLLER_ONLY=n
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
CONFIG_BT_CLASSIC_ENABLED=n

# Reduce BT controller IRAM usage
CONFIG_BTDM_CTRL_BLE_MAX_CONN=1
CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN=0
CONFIG_BTDM_CTRL_BR_EDR_MAX_SYNC_CONN=0
